app/controllers/microposts_controller.rb

  def create
  	 @micropost = current_user.microposts.build(micropost_params)
    if @micropost.save
---
INSERT INTO "microposts" ("content", "user_id", "created_at", "updated_at", "picture") VALUES (?, ?, ?, ?, ?)  [["content", "Só não vale copiar"], ["user_id", 101], ["created_at", "2018-05-27 01:27:14.239050"], ["updated_at", "2018-05-27 01:27:14.239050"], ["picture", "auxiliar"]]