app/controllers/password_resets_controller.rb

   def update
    if params[:user][:password].empty?                  # Case (3)
      @user.errors.add(:password, "can't be empty")
      render 'edit'
    elsif @user.update_attributes(user_params)          # Case (4)
---
UPDATE "users" SET "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["password_digest", "$2a$10$2eMkHILRpYcwHlAWT5xCCeyd4GhdaD8HE1x8273/iul5Nu/IlcbL."], ["updated_at", "2018-05-25 01:00:57.899361"], ["id", 108]]